/*
Ќапишите программу, котора€ вводит
с клавиатуры вещественное x (используйте тип double), вычисл€ет

дл€ данного x частичную сумму р€да (*), в которой участвуют толь-
ко те слагаемые, которые не меньше 0.0001 (слагаемые монотонно

убывают), и выводит модуль разности между вычисленной суммой
и значением библиотечной функции exp(x) из заголовочного файла
cmath/math.h (вывести не менее 6 знаков после дес€тичной точки).
*/

#include <iostream>
#include <cmath>

using namespace std;

int main(){
	int i;
	double x, sum=0;

	cin >> x;

	//...
	return 0;
}